Repository: OpenChain-Project/Curriculum-Translation-JP
Catalog: Curriculum-Translation-JP-omegat.tmx
Source language: en_us
Languages: ja

source: This slide explains notices, the text comments in files that explain authorship and licensing, and which are often regarded as the most important way of knowing what license applies to a file.
ja: このスライドでは、告知／通知／表示（Notice)について説明しています。これは、ファイルにある文字列（テキスト） のコメントで著作者やライセンスについて説明するものです。そして多くの場合、ファイルに対しどういったライセンスが適用されるかを知る、もっとも重要な方法として認識されています。

source: This slide explains proprietary or closed source licenses.
ja: このスライドでは、プロプライエタリもしくはクローズド ソース ライセンスについて説明しています。

source: This slide explains public domain, a type of release that means the work is released without any restrictions whatsoever by the authors.
ja: このスライドではパブリックドメインについて説明しています。作品に対しそれが何であれいかなる制約もないことを意味する、公開タイプの一つといえます。

source: This slide explains reciprocity and Copyleft, a more complex type of FOSS license that have additional requirements above permissive licenses.
ja: このスライドでは、パーミッシ ブライセンスに付加的な要求事項をもつ、より複雑なタイプのFOSSライセンスとして互恵性と「コピーレフト」 ついて説明しています。

source: This slide explains some of the conditions or restrictions commonly encountered when using FOSS licenses.
ja: このスライドではFOSSライセンスの使用する際に出くわす共通的な条件や制約のいくつかについて説明しています。

source: This slide explains that FOSS compliance is really a two-part goal.
ja: このスライドではFOSSコンプライアンスには 実際のところ目的が二つあることを説明しています。

source: This slide explains the “big picture” of copyright in software.
ja: このスライドでは、ソフトウェアの著作権についての "全体像"を説明しています。

source: This slide explains when FOSS obligations are “triggered.” FOSS licenses are copyright licenses and the basic compliance trigger is when you distribute code to another legal entity.
ja: このスライドでは、いつFOSSライセンスの義務が「発動(trigger)される」のかについて説明しています。FOSSライセンスは著作権ライセンスであり、基本的なトリガーはコードを他の法人（legal entity）に 頒布するときです。

source: This slide explains ”permissive” FOSS licenses, the most basic type of FOSS license, which usually have minimal requirements.
ja: 本スライドでは、「パーミッシブな」FOSSライセンスと、通常要求が最低限となっているFOSSライセンスのもっとも基本タイプについて説明しています。

source: This slide explains patent concepts relevant to software.
ja: このスライドでは、ソフトウェアに関連する 特許の概念を説明しています。

source: This slide explains some of the concepts behind distribution.
ja: このスライドでは頒布することのお背景にあるいくつかの考え方を説明しています。

source: This slide explains that modifying code can impose obligations under FOSS licenses.
ja: このスライドでは、 コードの改変がFOSSライセンス下の義務を課すものとなりうることを説明しています。

source: This slide is an overview of the steps that will be described in this chapter.
ja: このスライドは、本章で述べる各ステップの全体像です。

source: This slide is intended to help a company identify where their internal FOSS policy is located in the company documentation.
ja: このスライドで、企業が、社内文書として内部FOSSポリシーがどこにあるか特定しやすいようにします。

source: This slide provides the “big picture” about what FOSS licenses do.
ja: このスライドでは、FOSSライセンスがどういったことをするかの 「全体像（ビッグ ピクチャ）」を提供します。

source: This slide expands on what compliance obligations must be satisfied in typical FOSS licenses.
ja: このスライドでは 代表的なFOSSライセンスにおいてコンプライス義務としてどういったことを果たされなければならないかについて話を広げています。

source: This slide is about how the use of FOSS components is a consideration for your compliance.
ja: このスライドは コンプライアンスにおいてFOSSコンポーネントの使用はどういったことを考慮すべきかという点について触れています。

source: This slides explains the boundaries of what can be in a license.
ja: ここではライセンスの中にどういったものがあるか、その境界を説明しています。

source: This slides explains multi-licensing.
ja: このスライドは マルチライセンスについて説明しています。

source: This slides explains that development tools may do some of these actions “behind the scene”, and this is an area that companies should be aware of.
ja: このスライドでは開発ツールが「裏方となって」これらのアクションを実施する場合があることを説明しています。この内容は企業によく知っておいていただきたいところです。

source: This slides outlines what incorporation means when using FOSS.
ja: このスライドでは、 FOSSを使う際にそれを取り込むということの意味についての概要を述べています。

source: This slides outlines what linking means when using FOSS.
ja: このスライドでは FOSS使う際にそれをリンクするということの意味にについての概要を述べています。

source: This slides outlines what modification means when using FOSS.
ja: このスライドではFOSSを使う際にそれを改変するということの意味についての概要を述べています。

source: This slides outlines what translation means when using FOSS.
ja: このスライドでは FOSSを使う際にそれを翻訳するということの意味についての概要を述べています。

source: This step could be a function of an entity providing oversight for the overall FOSS review process.
ja: このステップはFOSSレビュープロセス全体を監督する、一組織体の一機能であることがあります。

source: This step may be closely linked with the previous step (Resolving Audit Issues).
ja: このステップは直前のステップ（監査での問題を解決する）と密接に関係しています。

source: This step may have been initiated by one of the events listed in “prerequisites.” For example, a development team may have initiated a request (or initiated a FOSS Review).
ja: このステップは、「前提条件」で挙げたイベントのうちの一つによって始動されます。例えば開発チームがリクエストを上げた（もしくはFOSSレビューを開始した）といった場合です。

source: This team may include:
ja: チームとしては以下のようなものがあります：

source: This type of failure can be
ja: この種の失敗は、

source: This type of failure occurs during the development process when engineers add (or cut and paste) FOSS code into source code that is proprietary (to you to you or to a third party) in conflict with your FOSS policies.
ja: この種の失敗は開発プロセス中、エンジニアが（自社にとって、もしくはサード パーティにとって）プロプラエタリソースのコードにFOSSポリシーに合致しないFOSSコードを追加（もしくカット＆ペースト）するときに起こります。

source: This slide explains what is a “license.” This is different to a contract under US law.
ja: この スライドは、「ライセンス」とは何かを説明しています。本内容は米国法令下での契約と異なっています。

source: This slide is relevant to providing either a single three hour training session or explaining how a series of shorter sessions focused on “per chapter” training will work.
ja: この スライドは単体で3時間のトレーニングセッションを提供する場合や、"章ごと"に重点を置いたトレーニングで、各セッションが全体体系でどのような位置付けとなるかを説明する場合に対応します。

source: To gather and analyze information regarding FOSS usage and to produce appropriate guidance.
ja: FOSSの使用に関する情報を収集し、分析するため、および適切な助言を作成するためです。

source: Tracking FOSS software within the development process
ja: 開発プロセスでのFOSSソフトウェアの追跡

source: Trade secrets: protects confidential and valuable information
ja: 営業秘密：価値ある機密情報を保護する

source: Trademarks: protects marks (word, logos, slogans, color, etc.) that identify the source of the product
ja: 商標：（言葉、ロゴ、標語、色などの）プロダクトの出所を識別する標識を保護する

source: Training
ja: トレーニング

source: Translate the material
ja: 素材を翻訳

source: Translating Chinese to English
ja: 中国語から英語への翻訳

source: Translation
ja: 翻訳する（Translation）

source: Translation is when you transform the code from one state to another.
ja: 翻訳とはコードをある状態から別の状態に変換することです。

source: Type & Description
ja: 種類と説明

source: Types of use allowed (distribution, derivative works / to make, have made, manufacture)
ja: 許可される使用種別（頒布、二次的著作物、作る、作らせる、加工する）

source: Typical obligations of a permissive FOSS license are that the copyright notice and warranty disclaimer are included with the software.
ja: パーミッシブなライセンスの典型的な義務は、著作権表示と保証免責条項がソフトウェアに含まれることです。

source: Ultimately, the process should result in clear guidance on FOSS usage.
ja: このプロセスは最終的にFOSS使用に関する明確な助言となる必要があります。

source: Under disjunctive licensing you have a choice of licensing, i.e. GPL and a more permissive license option, you may choose which license you are going to distribute under depending on license compatibility, license requirements.
ja: 離接的なライセンスの下では、ライセンスを選択することができます。つまりGPLとよりパーミッシブなライセンスが選択肢にあった場合、どちらか をライセンスの 両立性と 要求事項に依存してどちらのライセンスで頒布するか選択することができます。

source: Unplanned inclusion of copyleft FOSS into proprietary or 3rd party code:
ja: プロプライエタリ、もしくはサード パーティのコードへの意図していなかったコピーレフトOSSの内包

source: User Space
ja: ユーザ空間

source: Utilizing
ja: 活用（Utilizing）

source: Validate compliance with license obligations
ja: ライセンス義務のコンプライアンスを評価する

source: Verification
ja: 検証（Verification）

source: Verification – Provide oversight for compliance process.
ja: 評価（Verification）－コンプライアンスプロセスの監督を実施します。

source: Verifications
ja: 検証（Verification）

source: Verified Distributed Compliance Artifacts are appropriately provided
ja: 頒布コンプライアンス関連資料が適切に提供された

source: Verify FOSS packages destined for distribution have been identified and approved
ja: 頒布向けのFOSSパッケージが明確になっていて承認されていることを確認する

source: Verify accompanying source code (if any) has been uploaded or distributed correctly
ja: 添付ソースコードが（あるならば）それが適切にアップロードされたか、頒布されたかを確認する

source: Verify all appropriate notices have been included to inform end-users of their right to request source code for identified FOSS
ja: エンドユーザに向けに当該FOSSのソースコードをリクエストできる権利について情報提供するために適切な告知／通知／表示（notice）が全て盛り込まれていることを確認する

source: Verify appropriate notices are provided
ja: 適切な告知／通知／表示（notice）が提供されていることを検証する

source: Verify compliance with other identified obligations
ja: その他確認された義務についての履行を確認する

source: Verify notices have been properly published and made available
ja: 告知／通知／表示（notice）が適切に公開され、有効にさせられたかを確認する

source: Verify source code packages for distribution
ja: 頒布用のソースコード パッケージを検証する

source: Verify that distributed software has been reviewed and approved
ja: 頒布されるソフトウェアがレビューされ承認されたことを確認する

source: Verify the reviewed source code matches the binary equivalents shipping in the product
ja: レビューされたソースコードが製品として出荷されるバイナリ形態の同等物と合致していることを確認する

source: Verify uploaded or distributed source code corresponds to the same version that was approved
ja: アップロードされた、頒布されたソースコードが承認されたものと同じ版数となっていることを確認する

source: Verify other identified obligations are met
ja: その他確認された義務が履行されているかを確認する

source: Version
ja: 版数（バージョン）

source: Very often, the license would expressly prohibits users from using the author's name without permission.
ja: 多くの場合、当該ライセンスでは許可なく著作者の名前を使用することを明確に禁止しています。

source: Welcome to the OpenChain Curriculum Slides.
ja: OpenChain カリキュラムのスライドへようこそ。

source: What Compliance Obligations Must Be Satisfied?
ja: 果たすべきコンプライアンスの義務にはどんなものがあるか？

source: What additional information is important when reviewing a FOSS component from an outside vendor?
ja: 外部ベンダーからのコンポーネントをレビューする際に追加的な情報として重要なものは何ですか？

source: What are some benefits of a FOSS Compliance Program?
ja: FOSSプログラムのメリットとしてどんなものがありますか？

source: What are two main goals of a FOSS Compliance Program?
ja: FOSSコンプライアンス プログラムの二つの主要なゴールとはなんですか？

source: What are typical obligations of a permissive FOSS license?
ja: パーミッシブなFOSSライセンスの典型的な義務としてどういったものがありますか？

source: What copyright rights are most important for software?
ja: ソフトウェアにとってもっとも重要なのはどのような著作権ですか？

source: What does FOSS compliance mean?
ja: FOSSコンプライアンスとは何を意味しますか？

source: What does an architecture review look for?
ja: アーキテクチャレビューでは何を期待しますか？

source: What does license reciprocity mean?
ja: ライセンスの互恵性とはどういったことを意味していますか？

source: What factors are important in assessing a distribution?
ja: 頒布を査定する上で重要な要素としてどんなものがありますか？

source: What format for delivery?
ja: デリバリ用のフォーマットは何か？

source: What information do you need to gather?
ja: どんな情報を集める必要があるか？

source: What information helps identify who is licensing the software?
ja: 誰がそのソフトウェアのライセンスを供与しているかを特定するにはどういった情報が役に立ちますか？

source: What information may you find in FOSS Notices, and how may the notices be used?
ja: FOSSの告知／通知／表示（Notice）にはどういった情報がありますか？またそれらはどのように使われますか？

source: What is Intellectual Property?
ja: 知的財産とは何か？

source: What is a FOSS license?
ja: FOSSライセンスとはどういったものでしょうか？

source: What is a multi-license?
ja: マルチライセンスとはどういったものでしょうか

source: What is incorporation?
ja: 取り込むというのはどんなことですか？

source: What is involved in compliance due diligence (for our example process, describe the steps at a high level)?
ja: コンプライアンスの注意義務（due diligence）としてどんなことが関係してきますか？（例えばここでのプロセスとして、高いレベルでのステップを述べてください）

source: What is linking?
ja: リンクするとはどういうことですか？

source: What is modification?
ja: 改変するとはどういうことですか？

source: What is the first action you should take if you want to use FOSS components?
ja: FOSS コンポーネントを使いたい場合に、最初に行うべき最初のアクションはどういったことでしょうか？

source: What is the format for delivery?
ja: デリバリはどんなフォーマットか？

source: What is the purpose of a FOSS Review?
ja: FOSSレビューの目的は何でしょうか？

source: What is translation?
ja: 翻訳するとはどういうことですか？

source: What is “Intellectual Property”?
ja: "知的財産”とは何か？

source: What kinds of information might you collect for a FOSS review?
ja: FOSSレビューのためにどういった種類の情報を集めますか？

source: What needs to be distributed for code used under a copyleft license?
ja: コピーレフトライセンスの下で使用されるコードについては何が頒布される必要がありますか？

source: What rights does a patent give to the patent owner?
ja: 特許はその保有者に対しどういった権利を付与しますか？

source: What should you do if you have a question about using FOSS?
ja: FOSSを使うことについて質問や疑問があった場合、何をすべきですか？

source: What steps can be taken to assess the quality of information collected in a FOSS Review?
ja: FOSSレビューで収集された情報の質を評価するためにどういったステップを取ることができますか？

source: What type of material does copyright law protect?
ja: 著作権法はどのようなものを保護しますか？

source: When analyzing FOSS usage, collect information about the identity of the FOSS component, its origin, and how the FOSS component will be used.
ja: FOSSの使用を分析にあたり、FOSSコンポーネントいついてそれがどんなものか、その起源、どのように使用されるかといった情報を集めます。

source: When thinking about distribution of Open Source you should consider two things:
ja: オープンソースを頒布することを 考える際には2つのtことを 考える必要があります：

source: Where the source code will be maintained
ja: ソースコードがどこでメンテナンスされるか

source: Whether the package had previously been approved for use in another context
ja: そのパッケージが他の経緯で以前に承認されたことがないか？

source: Whether you have made modifications
ja: 改変を加えたかどうか

source: Who are the decision makers about FOSS usage (managers, architects, individual engineers, etc.)?
ja: FOSSの使用について誰が意思決定者なのか（マネージャ、アーキテクト、個々の技術者など）？

source: Who receives the software?
ja: そのソフトウェアを受け取るのはだれか？

source: Work
ja: 取り組む

source: Working through the FOSS Review
ja: FOSSレビューに取り組む

source: Working through the FOSS Review process is interactive.
ja: FOSSレビュープロセスは、インタラクティブな取組みです。

source: Written Offer
ja: 書面による申し出（Written Offer）

source: You can deliver these slides as one half-day training session or you can deliver each chapter as a separate module.
ja: このスライドを半日のトレーニングセッションとして提供することができます。各章を分け、個別のモジュールとして構成した形で提供することも可能です。

source: You may also want to obtain copyright and attribution notices, and source code for vendor modifications if these are needed to satisfy license obligations for FOSS licenses governing the third party software.
ja: 第三者がコントロールするFOSSライセンスの義務を履行するために合、著作権表示、帰属表示およびベンダーの改変に対応するソースコードを入手する必要があるかもしれません。

source: [Insert Components]
ja: [コンポーネント名を入れてください]

source: [Insert interaction method]
ja: [相互作用の方法を入れてください]

source: audit issues in line with
ja: 監査での全問題

source: avoided by:
ja: 以下の対策によって回避されることがあります：

source: code
ja: 確認

source: company FOSS policies
ja: を解決する

source: compliance record of FOSS software components
ja: コンプライアンス記録をレビューし、承認する

source: discovered by scanning or auditing the source code for possible
ja: ソースコードをスキャンもしくは監査実施の結果、

source: for publication
ja: 告知／通知／表示（notice）をまとめる

source: g., "All of the code and documentation in this software has been dedicated to the public domain by the authors."
ja: 例）「本ソフトウェアの全てのコードと文書類は著作者によりパブリックドメインにささげられました」

source: identification
ja: 確認（Identification）

source: in inventory per
ja: 製品ごと、リリースごとに

source: license of source
ja: ライセンスの

source: matches with:
ja: 以下と合致可能性があるものとして発見されることがあります：

source: notices and provide written offer
ja: を公開する

source: product and per
ja: 一覧表（inventory）に

source: release
ja: 記録する

source: scanning tools may be used for
ja: 自動スキャンツールを

source: software/version
ja: ソフトウェア／版数（バージョン）を

source: this purpose
ja: この目的で使用することができます。

source: verifications
ja: 検証

source: The review team will then create a record of the review, then move to the next step (“Audit”).
ja: このときにレビューチームはレビュー記録を生成し、次の「監査」ステップに進みます。

source: – and –
ja: － および －

source: “dual” = confusing term that may be used for any of these situations, but usually refers to business model of OSS license or commercial license choice
ja: 「デュアル（Dual）」＝ここでかいた状況すべてで使われ売る、混乱を招く用語ですが 、通常この用語はOSSライセンスもしくは商用ライセンスの選択に関するビジネスモデルについて言及しています。

source: “Hits” from the audit or scan are reviewed and verified as to the proper origin of the code
ja: 監査やスキャンによって「ヒット」したものがレビューされ、コードの起源が適正かどうかが検証される

source: “The contents of this file are subject to the Mozilla Public License Version - 1.1 (the "License"); you may not use this file except in compliance with - the License.
ja: 「本ファイルの内容は Mozilla Public License Version 1.1 (「本ライセンス」) の適用を受けます。本ライセンスに従わない限り本ファイルを使用することはできません。
